{
    "intents": [
        {
            "tag": "Khái niệm",
            "patterns": [
                "Giải là gì",
                "Một số thông tin về giải đấu",
                "Giải đấu là gì",
                "Giải đấu tennis",
                "Các giải đấu tennis",
                "Ý nghĩa giải đấu",
                "Định nghĩa giải đấu",
                "Các thông tin giải"
            ],
            "responses": [
                "Một giải đấu tennis là một sự kiện thể thao mà các tay vợt chuyên nghiệp tham gia, cạnh tranh để giành chiến thắng trong một chuỗi các trận đấu với thể thức quy định. Các giải đấu này thường được tổ chức tại các địa điểm và quốc gia khác nhau trên toàn cầu, và họ có thể thu hút sự chú ý lớn từ cộng đồng yêu tennis."
            ]
        },
        {
            "tag": "Thời gian thi đấu",
            "patterns": [
                "Thời gian diễn ra giải đấu",
                "Lịch trình thi đấu",
                "Khi nào diễn ra giải",
                "Lịch trình giải đấu",
                "Lịch trình giải",
                "Thời gian thi đấu của giải",
                "Thời gian giải"
            ],
            "responses": [
                "Thời gian diễn ra giải đấu thường được xác định trước và thông tin về lịch trình thi đấu có thể được tìm thấy trên trang web chính thức của giải hoặc các nguồn tin tức thể thao uy tín."
            ]
        },
        {
            "tag": "Cơ cấu giải thưởng",
            "patterns": [
                "Giải thưởng của giải đấu",
                "Tổng giải thưởng",
                "Phần thưởng cho người chiến thắng",
                "Phần thưởng cho những tay vợt hàng đầu",
                "Cơ cấu giải thưởng của giải",
                "Phần thưởng của giải",
                "Vô địch giải được nhận bao nhiêu tiền",
                "Số tiền của nhà vô địch",
                "Tiền thưởng của giải",
                "Số tiền thưởng của giải đấu",
                "Nhà vô địch có số tiền thưởng là bao nhiêu"
            ],
            "responses": [
                "Thời gian diễn ra giải đấu thường được xác định trước và thông tin về lịch trình thi đấu có thể được tìm thấy trên trang web chính thức của giải hoặc các nguồn tin tức thể thao uy tín."
            ]
        },
        {
            "tag": "Địa điểm tổ chức",
            "patterns": [
                "Nơi tổ chức giải",
                "Địa điểm diễn ra giải",
                "Sân thi đấu được chọn ở đâu?",
                "Giải được tổ chức tại quốc gia nào?",
                "Giải đấu diễn ra tại đâu?",
                "Địa điểm tổ chức giải",
                "Quốc gia nào đăng cai giải",
                "Quốc gia nào tổ chức giải",
                "Nơi diễn ra giải đấu",
                "Giải đấu được diễn ra ở đâu",
                "Tên quốc gia nào tổ chức giải đấu"
            ],
            "responses": [
                "Thông tin về địa điểm tổ chức giải đấu thường được công bố trước trên truyền thông và các trang web chính thức của giải. Các sân đấu có thể nằm ở nhiều quốc gia và thường được lựa chọn dựa trên hạ infrastruture, sức chứa và uy tín của giải."
            ]
        },
        {
            "tag": "Thể thức thi đấu",
            "patterns": [
                "Thể thức thi đấu của giải",
                "Cách thi đấu trong giải",
                "Hình thức của giải đấu",
                "Luật lệ thi đấu của giải đấu",
                "Số set thi đấu trong trận đấu của giải",
                "Thông tin các vòng đấu của giải",
                "Các vòng đấu của giải",
                "Giải đấu tổ chức với thể thức và cách thi đấu nào",
                "Giải đấu tổ chức với thể thức và luật lệ nào"
            ],
            "responses": [
                "Thể thức và cách thi đấu của mỗi giải đấu có thể khác nhau, bao gồm cả số set, loại hình thi đấu (đơn hay đôi), và luật lệ cụ thể. "
            ]
        },
        {
            "tag": "Lịch sử của giải",
            "patterns": [
                "Những thông tin về lịch sử của giải",
                "Các thông tin về lịch sử",
                "Những kỷ niệm trong quá khứ của giải",
                "Lịch sử giải đấu",
                "Những kỷ niệm của giải",
                "Những kỷ niệm đáng nhớ của giải",
                "Quá trình hình thành của giải",
                "Quá trình và lịch sử giải đấu"
            ],
            "responses": [
                "Lịch sử của một giải đấu bao gồm các thông tin về việc thành lập, những kỷ niệm đáng nhớ, các tay vợt nổi tiếng từng vô địch và các sự kiện đặc biệt trong quá khứ của giải."
            ]
        },
        {
            "tag": "Các giải đấu",
            "patterns": [
                "Danh sách các giải đấu Tennis",
                "Các giải đấu nổi tiếng",
                "Các giải đấu nhiều người biết đên",
                "tên các giải đấu"
            ],
            "responses": [
                "Các giải đấu Tennis nổi tiếng nhất bao gồm: Grand Slam, ATP Finals, ATP Tour Masters 1000,WTA Tour Premier Mandatory/Premier 5, Davis Cup và Fed Cup. Đó cũng là các giải đấu mà tôi đang có thông tin. Nếu bạn muốn tìm hiểu về giải đấu nào vui lòng cho tôi biết"
            ]
        }
    ],
    "tag": "Thông tin về các giải đấu tennis"
}